[
  {
    "id": 1,
    "src2": "https://i.ibb.co/NgGsNjtJ/image.png",
    "src1": "https://i.ibb.co/m53P4B79/image.png",
    "name": "Chat App",
    "link": "https://quick-ai-frontend-gamma.vercel.app/",
    "repo": "https://github.com/PoojaSingh31github/quick-ai-frontend",
    "info": "Backend built with Node.js, Express.js, MongoDB, JWT authentication, and Socket.io for real-time communication. Includes protected routes, user authentication, chat messaging APIs, profile management, and Cloudinary integration for media storage.",
"info2": "Frontend developed with React (Vite), Context API, Tailwind CSS, and Socket.io client. Features include real-time one-to-one chat, responsive UI, theme customization (light/dark), profile pages, online/offline status, and media sharing support.",
 "team": "This is the project that was individually done by me and completed in 6 Days.",
    "tstack": "MERN | COOKIES | WEBSOCKET ",
    "direction": false
  },
  {
    "id": 2,
    "src2": "https://i.ibb.co/bj3vCHq8/image.png",
    "src1": "https://i.ibb.co/spYKSx3B/image.png",
    "name": "Quick AI",
    "link": "https://quick-ai-frontend-gamma.vercel.app/",
    "repo": "https://github.com/PoojaSingh31github/quick-ai-frontend",
    "info": "Backend powered by Express.js with Clerk Authentication, Gemini API, NeonDB, and Cloudinary integration for secure image management. Implements RESTful APIs and real-time dashboard updates via Redux Toolkit.",
    "info2": "Frontend built with React.js, TypeScript, and Tailwind CSS, featuring reusable modular components for scalable UI architecture and seamless user experience.",
    "team": "This is the project that was individually done by me and completed in 6 Days.",
    "tstack": "REACT | STATE MANAGEMENT | SQL | AI/ML",
    "direction": true
  },
  {
    "id": 3,
    "src1": "https://i.ibb.co/6gNJLd2/image.png",
    "src2": "https://i.ibb.co/Rz6stzN/image.png",
    "name": "MERN E-Commerce Website",
    "link": "https://ep-froneend.vercel.app/",
    "repo": "https://github.com/PoojaSingh31github/MERN-ecommerce-project",
    "info": "Backend deployed via Render, using Express with MongoDB. Utilizes various packages for authentication, payment processing (Braintree), controllers for user, category, and product actions",
    "info2": "Frontend deployed via Vercel, utilizes React with various packages for testing, UI components (Ant Design), routing (React Router), and state management (Context API).",
    "team": "This is the project that was individually done by me and completed in 10 Days.",
    "tstack": "MERN | BOOTSTRAP | ANIMATE.CSS",
    "direction": false
  },
  {
    "id": 4,
    "src1": "https://i.ibb.co/8bHvMDQ/image.png",
    "src2": "https://i.ibb.co/C9sj9sC/image.png",
    "name": "E-R diagram builder",
    "link": "https://entity-craft.vercel.app/",
    "repo": "https://github.com/PoojaSingh31github/WEB_039_Browser_Breakers",
    "info": "Backend deployed via Render, using Node.js and Express.js. Implements various routes for managing user authentication, diagram creation, updates, and export functionalities. Includes MongoDB for data storage and integrates a version control system for diagram revisions.",
    "info2": "Frontend deployed via Vercel, utilizing Vite, Context API, and Tailwind CSS for an intuitive and responsive user interface. Features include drag-and-drop diagram creation, entity and relationship editing, and exporting diagrams to various formats like PNG, PDF, and SVG.",
    "team": "This is the project that was done by 4 team members and completed in 5 Days.",
    "tstack": "REACT | XYFLOW | TAILWIND.CSS | MONGODB | EXPRESS | NODE.JS",
    "direction": true
  },
  {
    "id": 5,
    "src1": "https://i.ibb.co/fnzKRt3/image.png",
    "src2": "https://i.ibb.co/nz5WmNQ/image.png",
    "name": "Algorithm visualizer",
    "link": "https://al-orbiters-005-ouv85dcbg-poojasingh31githubs-projects.vercel.app/",
    "repo": "https://github.com/PoojaSingh31github/Al_Orbiters_005",
    "info": "Developed an interactive platform for visualizing sorting and searching algorithms to aid user understanding. Responsible for UI design and ensuring responsiveness across devices",
    "info2": "Implemented functionalities for complex algorithms like backtracking and binary search. Collaborated with a team of five, managing medium-level contributions in feature development.",
    "team": "A collaborative project of 5 team members completed in 5 days.",
    "tstack": "FIREBASE | TAILWIND.CSS | JAVASCRIPT | HTML | CSS ",
    "direction": false
  },

  {
    "id": 6,
    "src1": "https://i.ibb.co/qBHtnJ0/image.png",
    "src2": "https://i.ibb.co/N7vDR0c/image.png",
    "name": "Finance Manager",
    "link": "https://finance-manager-umber.vercel.app/",
    "repo": "https://github.com/PoojaSingh31github/Finance-Manager",
    "info": "Backend and Authentication: The backend is powered by Firebase, utilizing its Realtime Database for efficient storage and retrieval of financial data. Firebase Authentication is implemented to ensure secure user login and account management.",
    "info2": "Frontend and Data Visualization: The frontend is developed in React, with Tailwind CSS for an elegant and responsive UI. Financial data is beautifully visualized using Chart.js, providing users with interactive graphs and insights into their income, expenses, and savings trends.",
    "team": "This is the project that was individually done by me and completed in 1 Days.",
    "tstack": "REACT | TAILWIND.CSS | CHART.JS | FIREBASE",
    "direction": true
  }  
]
